<?php


function translit($arg)
{
    $arr = array(
        "a" => "a",
        "б" => "b",
        "в" => "v",
        "г" => "ge",
        "д" => "d",
        "е" => "e",
        "ё" => "yo",
        "ж" => "zh",
        "з" => "z",
        "и" => "i",
        "й" => "i",
        "к" => "k",
        "л" => "l",
        "м" => "m",
        "н" => "n",
        "о" => "o",
        "п" => "p",
        "р" => "r",
        "с" => "s",
        "т" => "t",
        "у" => "u",
        "ф" => "f",
        "х" => "х",
        "ч" => "ch",
        "ш" => "sh",
        "щ" => "sh",
        "ъ" => "b",
        "ы" => "i",
        "ь" => "'",
        "э" => "e",
        "ю" => "y",
        "я" => "ya",
    );
    $var=strtr("$arg", $arr);
    $var=str_replace(" ", "_", "$var");
    echo $var;
}


translit("я побежал домой а потом на дачу");